Emacs.org
PROPERTIES:
#+title: Emacs From Scratch Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init-g.el :mkdirp yes

* Lexical binding to top of file

#+begin_src emacs-lisp :tangle no
-*- lexical-binding: t -*-
#+end_src


* Tangle and Reload init file


#+begin_src emacs-lisp :tangle yes :noweb yes
  (org-babel-tangle)
#+end_src

#+RESULTS:
| /home/cgeng/emacs-conf/el/setup-themes.el | /home/cgeng/emacs-conf/el/org-general.el | /home/cgeng/emacs-conf/el/setup-json-mode.el | /home/cgeng/emacs-conf/el/setup-ess.el | /home/cgeng/emacs-conf/el/setup-python.el | /home/cgeng/emacs-conf/init-g.el | /home/cgeng/emacs-conf/Emacs.el |

* Collect Usage Stats

#+begin_src emacs-lisp
  `(setq use-package-compute-statistics t)
#+end_src

* Treesitter auto mode

Links:

- [[https://github.com/meain/evil-textobj-tree-sitter/][evil-textobj-treesitter]] Tree-sitter powered textobjects for Emacs
- [[https://github.com/tree-sitter/py-tree-sitter][py-tree-sitter is probably not required]] - lang bindings only
- [[https://github.com/tree-sitter/tree-sitter-python?tab=readme-ov-file][same as tree-sitter-python]] - lang bindings only
- [[https://www.youtube.com/watch?v=SOxlQ7ogplA][Video by Marie Helene]] is very useful anyway


#+begin_src emacs-lisp
(use-package treesit-auto
  :custom
  (treesit-auto-install 'prompt)
  :config
  (treesit-auto-add-to-auto-mode-alist 'all)
  (global-treesit-auto-mode))

#+end_src


* Termux Issue

#+begin_src emacs-lisp
(setq cg/is-termux
      (string-suffix-p "Android" (string-trim (shell-command-to-string "uname -a"))))

;; Fix an issue accessing the ELPA archive in Termux
(when cg/is-termux
  (setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3"))
#+end_src

#+RESULTS:

* Eearly Init - not needed?

https://www.masteringemacs.org/article/whats-new-in-emacs-27-1

However, if your init file changes the values of

- package-load-list
- or 'package-user-dir', or sets
- package-enable-at-startup to nil then


- You can move that code to the early init file (see above), so those
  settings apply before Emacs tries to activate the packages.
- You can use the new 'package-quickstart' so activation of packages
  does not need to pay attention to 'package-load-list' or
  'package-user-dir' any more.



* The whole Init File
:PROPERTIES:
:ID:       214b3d62-1d24-46f8-a373-e3a9e665602d
:END:




** Configure Startup
:PROPERTIES:
:ID:       8ae12a93-e115-4db2-a5fb-430354f6b6af
:END:

#+begin_src emacs-lisp
  ;; The default is 800 kilobytes.  Measured in bytes.
  ;; (setq gc-cons-threshold (* 50 1000 1000))
  ;; (setq gc-cons-threshold (* 350 1000 1000))

  ;; Profile emacs startup
  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "*** Emacs loaded in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))

#+end_src



** Coding System
:PROPERTIES:
:ID:       97c85ba1-ae76-4450-99a5-3ba469d4e46d
:END:

#+begin_src emacs-lisp

  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-language-environment 'utf-8)
  (set-selection-coding-system 'utf-8)

#+end_src



** Package and Load Process / Function Paths
:PROPERTIES:
:ID:       d201ac7f-645f-471b-9546-afef19448207
:END:

#+begin_src emacs-lisp

  ;; Setup packages
  ;; code obsolete in emacs27
  (if (version< emacs-version "27.1")
      (package-initialize)
    )

  (add-to-list 'load-path (expand-file-name "doom-snippets" user-emacs-directory))
  (setq doom-snippets-enable-short-helpers nil)
  (add-to-list 'load-path (expand-file-name "el" user-emacs-directory))
  ;; (add-to-list 'load-path "~/.emacs.d/elpa/s-20210616.619/")
  ;; (require 's)

  (use-package s :ensure t)
  ;; Functions (load all files in defuns-dir)
  ;;(add-to-list 'load-path user-emacs-directory)
  (setq defuns-dir (expand-file-name "defuns" user-emacs-directory))
  (dolist (file (directory-files defuns-dir t "^[^.#].*el$"))
    (when (file-regular-p file)
      (load (file-name-sans-extension file))))

  ;;  (require 'title-time)
  ;; (require 'setup-daimler-proxy)
  ;; ;; No splash screen please ... jeez
  (setq inhibit-startup-message t)

  ;; Settings for currently logged in user
  ;; keep automatic customizations separately
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (load custom-file 'noerror)

  ;; create user customization directory for specific username/hostname combination
  (defvar user-settings-dir)
  (setq user-settings-dir
        (joindirs user-emacs-directory "users" (concat user-login-name "-" (system-name) )))

  (mkdir user-settings-dir t)
  (add-to-list 'load-path user-settings-dir)

  ;; load all settings from user machine combination
  (when (file-exists-p user-settings-dir)
    (mapc 'load (directory-files user-settings-dir nil "^[^.#].*el$")))

  ;; Write backup files to own directory
  (setq backup-directory-alist
        `(("." . ,(expand-file-name "backups" user-emacs-directory))))

  ;; Make backups of files, even when they're in version control
  (setq vc-make-backup-files t)

  ;; Save point position between sessions
  (require 'saveplace)
  (setq-default save-place t)
  (setq save-place-file (expand-file-name ".places" user-emacs-directory))

  ;; Setup elnode before packages to stop it from starting a server
  ;;(require 'setup-elnode)
  ;; Setup packages
  (require 'setup-package)
  ;; Set path to dependencies
  (setq site-lisp-dir
        (expand-file-name "site-lisp" user-emacs-directory))

  ;; Set up load path and
  (add-to-list 'load-path site-lisp-dir)

  ;; Add external projects to load path
  (dolist (project (directory-files site-lisp-dir t "\\w+"))
    (when (file-directory-p project)
      (add-to-list 'load-path project)))

#+end_src



***** Straight

****** Try to install straigt to ~/.config/emacs

https://emacs.stackexchange.com/questions/60507/change-location-for-straight-el-working-directories

(message straight-base-dir)
(defvar config-list)
(setq config-list (directory-files (joindirs (getenv "HOME") ".config" "emacs" emacs-version "straight")))
(seq-filter (lambda (x) (string-match "emacs" x)) config-list)
(cl-remove-if-not #'evenp '(1 2 3 4 5))

(directory-files (joindirs (getenv "HOME") ".config" "emacs" emacs-version "straight")


#+begin_src emacs-lisp
  (setq straight-base-dir (joindirs (getenv "HOME") ".config" "emacs" emacs-version))
  (mkdir straight-base-dir t)
#+end_src

#+RESULTS:
: t

****** Initial bootstrap

First, place the following bootstrap code in your init-file:

#+begin_src emacs-lisp
    (defvar bootstrap-version)
    (let ((bootstrap-file
           (expand-file-name
            "straight/repos/straight.el/bootstrap.el"
            (or (bound-and-true-p straight-base-dir)
                user-emacs-directory)))
          (bootstrap-version 7))
      (unless (file-exists-p bootstrap-file)
        (with-current-buffer
            (url-retrieve-synchronously
             "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
             'silent 'inhibit-cookies)
          (goto-char (point-max))
          (eval-print-last-sexp)))
      (load bootstrap-file nil 'nomessage))

  (straight-use-package 'use-package)
  (straight-use-package 'yasnippet)
#+end_src

#+RESULTS:
: t

- This should only run once, so it can be left in the init file
- it wil create the directory straight in .emacs.d
- To install a package: (straight-use-package 'evil)
- M-x straight-use-package to see list of installables


#+begin_src emacs-lisp
    ;; org-20210929
    ;; org-contrib-0.6
    ;; org-ml-20230410.30
    ;; org-sql-20240819.2145
    ;; org-roam-20240715.1750
    ;; org-chef-20231127.1601
    ;; org-tree-slide-20230826.1234
    ;; org-special-block-extras-20230721.43
    ;; calfw-org-20170411.220
  (use-package org :straight (:type built-in))
  (use-package org-contrib :straight t)
  (use-package org-ml :straight t)
  (use-package org-sql :straight t)
  (use-package org-roam :straight t)
  (use-package org-tree-slide :straight t)
  (use-package org-special-block-extras :straight t)
  (use-package calfw-org :straight t)
  (use-package yasnippet-classic-snippets :straight t)

  ;; (use-package org :straight t)
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (26337 54677 231137 228000) :init (26337 54677 231135 199000) :config (26337 54677 231125 580000) :config-secs (0 0 2 537000) :init-secs (0 0 17 784000) :use-package-secs (0 1 147606 993000)))


***** Defaults
:PROPERTIES:
:ID:       8e48bca6-9fb1-4ce2-8234-784594027423
:END:

#+begin_src emacs-lisp
  ;; Allow pasting selection outside of Emacs
  (setq x-select-enable-clipboard t)
  (setq x-select-enable-primary t)

  ;; Auto refresh buffers
  (global-auto-revert-mode 1)

  ;; Also auto refresh dired, but be quiet about it
  (setq global-auto-revert-non-file-buffers t)
  (setq auto-revert-verbose nil)

  ;; Show keystrokes in progress
  (setq echo-keystrokes 0.1)

  ;; Set to t in order to move files to trash when deleting
  (setq delete-by-moving-to-trash nil)

  ;; Real emacs knights don't use shift to mark things
  (setq shift-select-mode nil)

  ;; Transparently open compressed files
  (auto-compression-mode t)

  ;; Enable syntax highlighting for older Emacsen that have it off
  (global-font-lock-mode t)

  ;; Answering just 'y' or 'n' will do
  (defalias 'yes-or-no-p 'y-or-n-p)

  ;; UTF-8 please
  (setq locale-coding-system 'utf-8) ; pretty
  (set-terminal-coding-system 'utf-8) ; pretty
  (set-keyboard-coding-system 'utf-8) ; pretty
  (set-selection-coding-system 'utf-8) ; please
  (prefer-coding-system 'utf-8) ; with sugar on top

  ;; Frame titles which are short and informative
  (setq frame-title-format '("%b - Emacs"))

  ;; Show active region
  (transient-mark-mode 1)
  (make-variable-buffer-local 'transient-mark-mode)
  (put 'transient-mark-mode 'permanent-local t)
  (setq-default transient-mark-mode t)

  ;; Remove text in active region if inserting text
  (delete-selection-mode 1)

  ;; ;; Don't highlight matches with jump-char - it's distracting
  ;; (setq jump-char-lazy-highlight-face nil)

  ;; Always display line and column numbers
  (setq line-number-mode t)
  (setq column-number-mode t)

  ;; Lines should be 80 characters wide, not 72
  (setq fill-column 80)

  ;; Save a list of recent files visited. (open recent file with C-x f)
  (recentf-mode 1)
  (setq recentf-max-saved-items 100) ;; just 20 is too recent

  ;; Highlight matching parentheses when the point is on them.
  (show-paren-mode 1)

  ;; Undo/redo window configuration with C-c <left>/<right>
  (winner-mode 1)

  ;; Never insert tabs
  (setq-default indent-tabs-mode nil)

  ;; Show me empty lines after buffer end
  (setq-default indicate-empty-lines t)

  ;; Easily navigate sillycased words
  (global-subword-mode 1)

  ;; ;; Don't break lines for me, please
  ;; (setq-default truncate-lines t)

  ;; Keep cursor away from edges when scrolling up/down
  ;; (require 'smooth-scrolling)
  ;; (setq scroll-step 1)
  ;; (setq scroll-conservatively 10000)
  (setq auto-window-vscroll nil)

  ;; org-mode: Don't ruin S-arrow to switch windows please (use M-+ and M-- instead to toggle)
  (setq org-replace-disputed-keys t)

  ;; Fontify org-mode code blocks
  (setq org-src-fontify-natively t)


  ;; ;; Sentences do not need double spaces to end. Period.
  ;; (set-default 'sentence-end-double-space nil)

  ;; Add parts of each file's directory to the buffer name if not unique
  (require 'uniquify)
  (setq uniquify-buffer-name-style 'forward)

  ;; A saner ediff
  (setq ediff-diff-options "-w")
  (setq ediff-split-window-function 'split-window-horizontally)
  (setq ediff-window-setup-function 'ediff-setup-windows-plain)

  ;; Nic says eval-expression-print-level needs to be set to nil (turned off) so
  ;; that you can always see what's happening.
  (setq eval-expression-print-level nil)

  ;; When popping the mark, continue popping until the cursor actually moves
  ;; Also, if the last command was a copy - skip past all the expand-region cruft.
  (defadvice pop-to-mark-command (around ensure-new-position activate)
    (let ((p (point)))
      (when (eq last-command 'save-region-or-current-line)
        ad-do-it
        ad-do-it
        ad-do-it)
      (dotimes (i 10)
        (when (= p (point)) ad-do-it))))

  ;; don't try to raise windows when switching to a buffer, because this
  ;; fails in any sane tiling window manager
  (setq ido-default-file-method 'selected-window
        ido-default-buffer-method 'selected-window)

  ;; highlight the current line in all buffers
  (global-hl-line-mode 1)

  (setq  realgud-safe-mode nil)

#+end_src

***** Show Line Numbers per Default, with some Exceptions
:PROPERTIES:
:ID:       fa826301-f5ae-4c2a-9280-84422f397ff0
:END:

#+begin_src emacs-lisp

  (global-display-line-numbers-mode t)

  ;; Override some modes which derive from the above
  (dolist (mode '(term-mode-hook
                  ag-mode-hook
                  magit-mode-hook
                  dired-mode-hook
                  comint-mode-hook
                  shell-mode-hook
                  helm-mode-hook
                  ibuffer-mode-hook
                  eshell-mode-hook))

    (add-hook mode (lambda () (display-line-numbers-mode 0)))
    )

#+end_src

#+RESULTS:


***** Set frame transparency, maximize windows.
:PROPERTIES:
:ID:       3e5a576d-bc05-4eb0-bc22-19964267f72f
:END:

#+begin_src emacs-lisp
  (set-frame-parameter (selected-frame) 'alpha '(99 . 99))
  (add-to-list 'default-frame-alist '(alpha . (99 . 99)))
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

#+RESULTS:
: ((fullscreen . maximized) (alpha 90 . 90) (vertical-scroll-bars) (left-fringe . 10) (right-fringe . 10))




***** Interface more minimalsitic(menubar etc.))
:PROPERTIES:
:ID:       53c1899a-035a-44f3-9460-d07523a3a1b3
:END:

Disable visible scrollbar when in graphical display
see https://superuser.com/questions/313398/how-to-prevent-the-symbols-function-definition-is-void-error-when-running-em

#+begin_src emacs-lisp

  (if (display-graphic-p)
      (progn
        (tool-bar-mode t)
        (scroll-bar-mode -1)
        (set-fringe-mode 10)        ; Give some breathing room
        ))

#+end_src

#+RESULTS:
: ((fullscreen . maximized) (alpha 99 . 99) (vertical-scroll-bars) (left-fringe . 10) (right-fringe . 10))

This does not result in visible menubar
#+begin_src emacs-lisp :tangle no
(defun restore-menu-bar()
  (interactive)
  (if (fboundp 'scroll-bar-mode) (scroll-bar-mode 1))
  (if (fboundp 'tool-bar-mode) (tool-bar-mode 1))
  (if (fboundp 'menu-bar-mode) (menu-bar-mode 1)))

(restore-menu-bar)
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp
      (tool-bar-mode 1)          ; Disable the toolbar
      ;;  (tooltip-mode -1)           ; Disable tooltips

      (menu-bar-mode t)            ; Disable the menu bar
#+end_src

***** Keyboard Interaction (and the Evil Chapter)
:PROPERTIES:
:ID:       7659bb1b-d161-4195-9d35-657b64674762
:END:

#+begin_src emacs-lisp
  ;; Smart M-x is smart - der ido fuer M-x
  (require 'smex)
  (smex-initialize)

  ;; Setup key bindings
  (require 'key-bindings)
  (require 'setup-helm)

  ;; Diminish modeline clutter
  (require 'diminish)

#+end_src

****** Expand region

;; expand regions semantically
;; see https://github.com/magnars/expand-region.el

#+begin_src emacs-lisp
(use-package expand-region
  :bind ("C-=" . er/expand-region))
#+end_src

#+RESULTS:
: er/expand-region

