Emacs.org
******** Pyright Code Checking Information
Django Problem
;; https://github.com/microsoft/pyright/issues/1359
;; Django Stubs: https://pypi.org/project/django-stubs/

;; flycheck
;; using pyright in emacs lsp as well as in vscode gives identical errors except
;; false errors in emacs that are flagged as "lsp-flycheck-info-unnecessary"
;; https://github.com/emacs-lsp/lsp-mode/issues/2255

;; Vergleich der standard-Autoformatters:
;; https://www.kevinpeters.net/auto-formatters-for-python

;; Emacs LSP-Ansatz:
;; jede Sprache macht es selbst, also kein allgemeines setup für lsp und dap:
;; https://alpha2phi.medium.com/emacs-lsp-and-dap-7c1786282324

;; Format Imports Isort -
;; formatting using black and isort
;; https://cereblanco.medium.com/setup-black-and-isort-in-vscode-514804590bf9

;; autoflake will also remove unused imports using pyflakes (which is what flake8 uses to check for extra imports
;;  flycheck-pyflakes  20170330.2311 available  melpa      Support pyflakes in flyc
;; pip install autoflake
;; importmagic
;;
;; yapf stanza example for setup.cfg
;;
;;
;; [yapf]
;; based_on_style = pep8
;; spaces_before_comment = 4
;; split_before_logical_operator = true
;; line-length = 119

;; lisp function to auto-remove unused imports:
;; https://gist.github.com/kracekumar/77d29c7410199fd2cda4

;; linting
;; https://code.visualstudio.com/docs/python/linting
;; https://github.com/emacs-lsp/lsp-mode/issues/1327




******** ImportMagic

Importmagic does not work!

https://github.com/anachronic/importmagic.el
$ pip install importmagic epc

#+begin_example emacs-lisp :tangle no

;;(use-package importmagic
 ;;   :ensure t
    ;; will add the hook into python usepackage configuration
    ;;:config
    ;;(add-hook 'python-mode-hook 'importmagic-mode)
   ;; )
#+end_example

******** Type Hinting
;; https://stackoverflow.com/questions/44094494/can-pycharm-suggest-or-autocomplete-or-insert-type-hints/44102211#44102211

******** Code Coverage in Emacs

- roll your own  ;; https://blog.laurentcharignon.com/post/universal-code-coverage/
- On Elpa:  pycoverage https://github.com/mattharrison/pycoverage.el
- not on elpa: https://github.com/wbolster/emacs-python-coverage/blob/master/python-coverage.el

#+begin_example
;;  cov                            20210330.44    available    melpa    Show coverage stats in the fringe.
;;  coverage                       20191113.1958  available    melpa    Code coverage line highlighting
;;  coverlay                       20190414.940   available    melpa    Test coverage overlays
#+end_example


****** LSP Python: Writing setup-python.el file the conf
:PROPERTIES:
:ID:       e1a1988b-a70a-435c-98e3-d95c61522659
:END:

******* Header
:PROPERTIES:
:ID:       6644930c-c376-4981-ae63-fc57ab4f5122
:END:

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes
  ;;; setup-python.el --- summary -*- lexical-binding: t -*-
  ;;
  ;;; Code:
#+end_src


******* Function to restart workspace - not functional
:PROPERTIES:
:ID:       41f1d2b5-4526-4261-aaaf-00525bd8034c
:END:

see http://ergoemacs.org/emacs/elisp_file_name_dir_name.html

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes
  (defun lsp-workspace-restart-deep ()
    (interactive
     (delete-file (joindirs user-emacs-directory  ".lsp-session-v1"))
     (lsp-workspace-restart))
    )
#+end_src

#+RESULTS:
: lsp-workspace-restart-deep

(load-file "~/.emacs.d/init.el")

#+RESULTS:
: lsp-workspace-restart-deep

******* Running Tests with python-pytest

https://github.com/wbolster/emacs-python-pytest

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes
  (use-package python-pytest
    :ensure t
    )
  (setq python-pytest-confirm t)
#+end_src

Hydra Usage:

#+begin_example
M-x python-pytest-dispatch
#+end_example

******* Format buffer using yapf
:PROPERTIES:
:ID:       674e2989-94c8-4dbe-976a-64ad936aa62c
:END:

really neceessary as yapf-mode, yapfify etc. exist

see https://github.com/seagle0128/.emacs.d/blob/master/lisp/init-lsp.el

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes

  (defun cg/python-yapf-format-buffer ()
    (interactive)
    (when (and (executable-find "yapf") buffer-file-name)
      (call-process "yapf" nil nil nil "-i" buffer-file-name)))

  ;; add hook example
  ;; (add-hook 'python-mode-hook
  ;;           (lambda ()
  ;;             (add-hook 'after-save-hook #'lsp-python-ms-format-buffer t t)))


#+end_src


******* Function to remove unused imports using autoflake
:PROPERTIES:
:ID:       5a5a162d-6b68-405d-9c47-02775e75271e
:END:

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes
  ;; does not work as custom variable
  ;; (defcustom python-autoflake-path
  ;;   (replace-regexp-in-string "\n$" "" (shell-command-to-string "which autoflake"))
  ;;   )

  (defvar python-autoflake-path
    (replace-regexp-in-string "\n$" "" (shell-command-to-string "which autoflake"))
    )

  (defun python-remove-unused-imports()
    "Use Autoflake to remove unused function"
    "autoflake --remove-all-unused-imports -i unused_imports.py"
    (interactive)
    (shell-command
     (format "%s --remove-all-unused-imports -i %s"
             python-autoflake-path
             (shell-quote-argument (buffer-file-name))))
    (revert-buffer t t t))
#+end_src

#+RESULTS:
: python-remove-unused-imports

******* Function to remove unused variables using autoflake
:PROPERTIES:
:ID:       9259bd8f-9cce-4f06-b262-d9f487959596
:END:

- this goes by using the --remove-unused-variables flag

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes


  (defun python-remove-unused-variables()
    "Use Autoflake to remove unused function"
    "autoflake --remove-all-unused-imports -i unused_imports.py"
    (interactive)
    (shell-command
     (format "%s --remove-unused-variables -i %s"
             python-autoflake-path
             (shell-quote-argument (buffer-file-name))))
    (revert-buffer t t t))

#+end_src

#+RESULTS:
: python-remove-unused-imports


******* Configure black formatter for brunette
:PROPERTIES:
:ID:       a7799b15-ad9f-4ab0-b55a-5ea7c6ef14e7
:END:

# blacken-executable
# (setq blacken-executable "brunette")
# (setq blacken-executable "/home/audeering.local/cgeng/.venvs/py37-data/bin/brunette")

# (defvar python-autoflake-path
# (concat pyvenv-virtual-env-path-directories "brunette")
# )

- blacken-buffer will format the buffer
- customizations are better kept in pyproject.toml when using black itself,
- setup.cfg is interpreted by black

#+begin_src emacs-lisp
  (use-package use-package-ensure-system-package :ensure t)
  (use-package blacken
    ;; :ensure t
    ;; :ensure-system-package (black . "pip3 install black")
    :custom
    (blacken-executable "brunette")
    ;; (blacken-line-length 119)
    )

#+end_src
******** Links

********* Formatting providers in vscode

https://dev.to/adamlombard/how-to-use-the-black-python-code-formatter-in-vscode-3lo0

-  file->preferences->type "python formatting provider"
-  This gets put into ~/cgeng/.config/Code/User/settings.json
  "python.formatting.provider": "black"
- file->preferences->type "format on save"

-  configure black
-  https://dev.to/adamlombard/vscode-setting-line-lengths-in-the-black-python-code-formatter-1g62
  file->preferences->type "python formatting black args"
- --line-length 119
- 119 characters


******* Aggregate Function to clean up - not functioning

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes
  (defun python-cleanup-this-file ()
    "All cleaning actions run in chain..."
    (interactive)
    (blacken-buffer)
    (python-remove-unused-imports)
    (py-isort-buffer)
    (python-remove-unused-imports)
    )
#+end_src


******* Rst autocomplete
:PROPERTIES:
:ID:       59d7132f-71a6-45b0-88b8-a2f15e3952f2
:END:

This packages seems not to be really well maintained.
I am revoming it as of 2024-08-21

https://github.com/tkf/auto-complete-rst

#+begin_src emacs-lisp  :tangle no :mkdirp yes
  ;; auto-complete-rst
  (require 'auto-complete-rst)
  (auto-complete-rst-init)
  ;; specify other sources to use in rst-mode
  (setq auto-complete-rst-other-sources
        '(ac-source-filename
          ac-source-abbrev
          ac-source-dictionary
          ac-source-yasnippet))
#+end_src

******* flymake ruff


#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes
  (use-package flymake-ruff
    :ensure t
    :hook
    (python-mode . flymake-ruff-load)
    (python-ts-mode . flymake-ruff-load)
    )
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (26354 41317 987108 240000) :init (26354 41317 987103 135000) :init-secs (0 0 58 882000) :use-package-secs (0 0 1501 267000) :config (26354 41317 987089 388000) :config-secs (0 0 1 784000)))

******* Jump to ruff check location

This is given as in ~file:line:column~ format

#+begin_example
foo.py:232:89: E501 Line too long (96 > 88)
#+end_example

#+begin_src emacs-lisp :tangle ./el/setup-python.el :mkdirp yes

  ;; Add the keybinding only to shell-mode and shell-mode derivatives
(add-hook 'shell-mode-hook
          (lambda ()
            (local-set-key (kbd "C-c f") 'jump-to-file-line-column)))

;; If you also want it in eshell
(add-hook 'eshell-mode-hook
          (lambda ()
            (local-set-key (kbd "C-c f") 'jump-to-file-line-column)))
#+end_src

#+RESULTS:
| #[nil ((local-set-key (kbd C-c f) 'jump-to-file-line-column)) nil] | #[nil ((local-set-key (kbd C-c f) 'jump-to-file-line-column)) (t)] | #[nil ((display-line-numbers-mode 0)) nil] | ess-r-package-activate-directory-tracker |


******* defconst line width - still needed?

#+begin_src emacs-lisp :tangle ./el/setup-python.el :mkdirp yes
  (defconst python-linewidth 89)
#+end_src

******* coverage

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes
  (require 'pycoverage)
  (defun my-coverage ()
    (interactive)
    (when (derived-mode-p 'python-mode)
      (progn
        (pycoverage-mode))))
#+end_src


******* pyvenv - virtual environments
#+begin_src emacs-lisp :tangle ./el/setup-python.el :mkdirp yes
  (use-package pyvenv
    :config
    (pyvenv-mode 1)
    (pyvenv-tracking-mode 1)
    )
#+end_src

******* Flyckeck Attempt to use Pylint

https://www.flycheck.org/en/28/_downloads/flycheck.html#Configuring-checkers
https://stackoverflow.com/questions/37720869/emacs-how-do-i-set-flycheck-to-python-3

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes
  ;; (add-hook 'flycheck-mode-hook #'flycheck-virtualenv-setup)
  (defun flycheck-python-setup ()
    (flycheck-mode)
    )
  ;; (add-hook 'python-mode-hook #'flycheck-python-setup)
#+end_src

#+begin_src emacs-lisp :tangle no :noweb yes
  (org-babel-tangle)
  (load-file "~/.emacs.d/init.el")
#+end_src

#+RESULTS:
: t

******* python-lsp-server specific

https://emacs-lsp.github.io/lsp-mode/page/lsp-pylsp/
https://github.com/python-lsp/python-lsp-server
https://github.com/emacs-lsp/lsp-mode/issues/2777
https://vxlabs.com/2018/06/08/python-language-server-with-emacs-and-lsp-mode/

pip install 'python-lsp-server[all]'
pip install 'python-lsp-server[websockets]

rope
Pyflakes
McCabe
pycodestyle
pydocstyle
autopep8
yapf
flake8
pylint


#+begin_src emacs-lisp :tangle ./el/setup-python.el :mkdirp yes

(use-package lsp-mode
  :ensure t
  :config

  ;; make sure we have lsp-imenu everywhere we have LSP
  (require 'lsp-imenu)
  (add-hook 'lsp-after-open-hook 'lsp-enable-imenu)
  ;; get lsp-python-enable defined
  ;; NB: use either projectile-project-root or ffip-get-project-root-directory
  ;;     or any other function that can be used to find the root directory of a project
  (lsp-define-stdio-client lsp-python "python"
                           #'projectile-project-root
                           '("pyls"))

  ;; make sure this is activated when python-mode is activated
  ;; lsp-python-enable is created by macro above
  (add-hook 'python-mode-hook
            (lambda ()
              (lsp-python-enable)))

  ;; lsp extras
  (use-package lsp-ui
    :ensure t
    :config
    (setq lsp-ui-sideline-ignore-duplicate t)
    (add-hook 'lsp-mode-hook 'lsp-ui-mode))

  (use-package company-lsp
    :config
    (push 'company-lsp company-backends))

  ;; NB: only required if you prefer flake8 instead of the default
  ;; send pyls config via lsp-after-initialize-hook -- harmless for
  ;; other servers due to pyls key, but would prefer only sending this
  ;; when pyls gets initialised (:initialize function in
  ;; lsp-define-stdio-client is invoked too early (before server
  ;; start)) -- cpbotha
  (defun lsp-set-cfg ()
    (let ((lsp-cfg `(:pyls (:configurationSources ("flake8")))))
      ;; TODO: check lsp--cur-workspace here to decide per server / project
      (lsp--set-configuration lsp-cfg)))

  (add-hook 'lsp-after-initialize-hook 'lsp-set-cfg))

  ;; (require 'lsp-pylsp)
#+end_src

******* Pyright specific code
******** The configuration

https://emacs-lsp.github.io/lsp-pyright/

Note: ~lsp-python-ms~ might be loaded with precedence and should be UNINSTALLED in orde to get this working!

Should become =:tangle no= when removed.

#+begin_src emacs-lisp :tangle no :mkdirp yes

  (use-package python-mode
    :straight t
    :hook (python-mode . (lambda ()
                           (require 'lsp-pyright)
                           (require 'highlight-indent-guides)
                           (require 'sphinx-doc)
                           (sphinx-doc-mode t)
                           (highlight-indent-guides-mode -1)
                           (auto-fill-mode)
                           (flycheck-python-setup)
                           (set-fill-column python-linewidth)
                           ;;(highlight-indent-guides-mode)
                           ;; (importmagic-mode)
                           (lsp-deferred)
                           ;; (yapf-mode)
                           (lsp-treemacs)
                           )
                       )
    :custom
    ;; NOTE: Set these if Python 3 is called "python3" on your system!
    ;; (python-shell-interpreter "python3")
    ;; (dap-python-executable "python3")
    ;; should be .dir-local:
    ;; (lsp-pyright-venv-path "~/.venvs/py37")
    (dap-python-debugger 'debugpy)
    :config
    (require 'dap-python)
    ;; (setq lsp-pyright-server-cmd `("node" "~/.vscode/extensions/ms-python.vscode-pylance-2021.5.3/dist/pyright.bundle.js" "--stdio"))
    )


  (setq lsp-enable-file-watchers nil)
  (setq lsp-file-watch-threshold 2000)

  (setq lsp-pyright-auto-import-completions t)
  ;;  Determines whether pyright automatically adds common search paths.
  ;; i.e: Paths like "src" if there are no execution environments defined in the
  ;; config file.
  (setq lsp-pyright-auto-search-paths t)
  (setq lsp-pyright-log-level "trace")

  (require 'dap-python)

  ;; (lsp-client-settings)

  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    ;; :bind (:map company-active-map
    ;;        ("<tab>" . company-complete-selection))
    ;;       (:map lsp-mode-map
    ;;        ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :hook (company-mode . company-box-mode))

#+end_src

