Emacs.org
******** Additional Notes
********* Pyright and npm

Problem:

#+begin_example
npx pyright
node: /lib/x86_64-linux-gnu/libc.so.6: version `GLIBC_2.28' not found (required by node)
#+end_example

nvm install 16.15.1
nvm use 16.15.1

=npx pyright= wird nur zum diagnostizieren genommen.
was man will ist pyright von der console zu starten

********* Build Pyright

Pylance = Pyright + IntelliCode AI models (not open-source)

#+begin_src bash :tangle no
  https://github.com/emacs-lsp/lsp-mode/issues/1863:
  entweder über vs code installieren oder selbst bauen
  git clone https://github.com/microsoft/pyright
  cd pyright
  npm i
  npm run build:serverProd
     ;; das sorgt dafür dass pyright bei mir im Pfad ist
     ;; which pyright
     ;; momentan befindet sich das hier: /home/audeering.local/cgeng/.nvm/versions/node/v12.22.1/bin/pyright
#+end_src

********* Use VS Code Version

#+begin_src emacs-lisp :tangle no
  ;; Nutzung der VSCode Version:
  ;; (setq lsp-pyright-server-cmd `("node" "~/.vscode/extensions/ms-python.vscode-pylance-2021.5.3/dist/pyright.bundle.js" "--stdio"))
  ;; (setq lsp-pyright-server-cmd `("node" "~/pyright/client/server/server.bundle.js" "--stdio"))
#+end_src

Activating venvs:
After changing the virtual env, the lsp workspace has to be restarted:
see https://github.com/emacs-lsp/lsp-pyright/issues/7

#+begin_src emacs-lisp :tangle no
  (lsp-restart-workspace)
#+end_src

********* Configuration

- Pyright LS uses a file called pyrightconfig.json to include settings
This is documented at https://github.com/microsoft/pyright/blob/main/docs/configuration.md
- This also statest that pyright settings can also be specified in a [tool.pyright] section of a "pyproject.toml" file.
- some of these settings are also
  https://blog.pilosus.org/posts/2019/12/26/python-third-party-tools-configuration/
-  https://github.com/emacs-lsp/lsp-pyright
- hoe to devise local adaptions to PYTHONPATH under Emacs lsp pyright?
- there is a custom variable:
- python.analysis.extraPaths via lsp-pyright-extra-paths

-  PYTHONPATH  Setting py-pythonpath as a .dir-local seems not to work https://github.com/porterjamesj/virtualenvwrapper.el/issues/56
- What works though is the customization of lsp-pyright-extra-paths
- All variables that are accessible through Emacs as defcustom are here:
  https://github.com/emacs-lsp/lsp-pyright

code/data_collection/aisoundlab/audb_covid_19/1.0.0/


********* pyrightconfig.json example

Not sure whehter emacs interprets this at all

#+begin_src json :tangle no
  {
      "exclude": ["**/node_modules", "**/__pycache__"],
      "ignore": ["**/node_modules", "**/__pycache__"],
      "include": ["flextensor", "tvm","1.0.0"],
      "pythonPlatform": "Linux",
      "pythonVersion": "3.7",
      "reportMissingImports": true,
      "reportMissingTypeStubs": false,
      "stubPath": "typings",
      "typeCheckingMode": "basic",
      "venvPath": "/home/audeering.local/cgeng/.venvs",
      "venv": "py37"
  }

#+end_src


#+begin_src bash :tangle no

#+end_src


#+begin_src bash :tangle no

#+end_src

*****







******* shell interpreter

Needs to come *BELOW* the ~(use-package python-mode ...)~ configuration:

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes
(setq python-shell-interpreter "ipython3"
        python-shell-interpreter-args "-i --simple-prompt")
#+end_src

******* Footer for setup-python

#+begin_src emacs-lisp  :tangle ./el/setup-python.el :mkdirp yes
  (provide 'setup-python)

  ;;; setup-python-lsp-python ends here

#+end_src


#+begin_src emacs-lisp
  ;; not  lsp
  ;; (require 'setup-python-elpy-jedi)   ;; was the old setup-python.el
  ;; (require 'setup-python-lsp-emacs-from-scratch)
  ;; (require 'setup-python-pyright)
  ;; (require 'setup-python-lsp-pyright)
  (require 'setup-python)
#+end_src

****** LSP SQL

https://github.com/lighttiger2505/sqls

#+begin_src emacs-lisp :tangle no
  (add-hook 'sql-mode-hook 'lsp)
  (setq lsp-sqls-workspace-config-path nil)
  (setq lsp-sqls-connections
      '(
        ((driver . "sqlite3") (dataSourceName . "/home/audeering.local/cgeng/work/myfiles/bikerides/data/processed/db.sqlite3"))
        ;; ((driver . "mysql") (dataSourceName . "yyoncho:local@tcp(localhost:3306)/foo"))
        ;; ((driver . "mssql") (dataSourceName . "Server=localhost;Database=sammy;User Id=yyoncho;Password=hunter2;"))
        ;; ((driver . "postgresql") (dataSourceName . "host=127.0.0.1 port=5432 user=yyoncho password=local dbname=sammy sslmode=disable"))
        )
      )
#+end_src

#+RESULTS:
| (driver . sqlite3)    | (dataSourceName . /home/audeering.local/cgeng/work/myfiles/bikerides/data/processed/db.sqlite3)      |
| (driver . mysql)      | (dataSourceName . yyoncho:local@tcp(localhost:3306)/foo)                                             |
| (driver . mssql)      | (dataSourceName . Server=localhost;Database=sammy;User Id=yyoncho;Password=hunter2;)                 |
| (driver . postgresql) | (dataSourceName . host=127.0.0.1 port=5432 user=yyoncho password=local dbname=sammy sslmode=disable) |


****** Other LSP Languages

:PROPERTIES:
:ID:       3fff27c7-73a4-4dfa-833a-86903c2d8d0b
:END:

#+begin_src emacs-lisp

  (require 'setup-typescript)
  (require 'setup-angular)
  ;; currently broken:
  ;; (require 'setup-c-lsp-clangd)
  ;; (require 'setup-c++)
  ;; (require 'setup-python-lsp-remember-you)

  (eval-after-load 'whitespace '(require 'setup-whitespace))
  (eval-after-load 'tramp '(require 'setup-tramp))
  ;; (require 'setup-perspective)
  ;; (require 'setup-ffip)
  ;; (require 'setup-paredit)

  (require 'mmm-auto)
  (mmm-add-mode-ext-class 'html-mode "\\.php\\'" 'html-php)

  (require 'setup-js2-mode)
  (require 'setup-web-mode)
  (require 'mmm-auto)
  (require 'setup-web-mode)
  (require 'setup-vue-mode)
#+end_src


***** R using ess
:PROPERTIES:
:ID:       f6b47430-8927-472c-99f9-dd3a7ce2cc4a
:END:

https://confunguido.github.io/blog/20190317_emacs_for_R.html
https://github.com/sejdemyr/.emacs.d/blob/master/init.el

#+begin_src emacs-lisp
(require 'setup-ess)
#+end_src


#+begin_src emacs-lisp  :tangle ./el/setup-ess.el :mkdirp yes

    ;;; setup-ess.el --- summary -*- lexical-binding: t -*-
  ;;
    ;;; Code:

;;; emacs speaks statistics
  (use-package ess
    :ensure t
    :init
    (require 'ess-site)
    )

  (provide 'setup-ess)
  ;;; setup-ess ends here


#+end_src


***** Electric Pair Mode

#+begin_src emacs-lisp
  ;; see http://ergoemacs.org/emacs/emacs_insert_brackets_by_pair.html
  (electric-pair-mode 1)
#+end_src


>***** SQL code formatting


see https://github.com/purcell/sqlformat

#+begin_src emacs-lisp

  (setq sqlformat-command 'sqlformat)
  (setq sqlformat-args nil)

  ;; (setq sqlformat-command 'pgformatter)
  ;; (setq sqlformat-args '("-s2" "-g"))
#+end_src

#+RESULTS:

***** Json Files

#+begin_src emacs-lisp :tangle ./el/setup-json-mode.el :mkdirp yes
      ;;; setup-json-mode.el --- summary -*- lexical-binding: t -*-

    ;; Author: CGeng
    ;; Maintainer: CGeng
    ;; Version: version
    ;; Package-Requires: (dependencies)

    ;;; Commentary:

    ;; commentary

    ;;; Code:


      ;;; name.el ends here
    (add-hook 'json-mode-hook
              (lambda ()
                (make-local-variable 'js-indent-level)
                (setq js-indent-level 4)
                (flycheck-mode)
                )
              )


    (defun beautify-json ()
    "Make json formatting beautiful in selected region.
        Formats json region to be better readable by a human."
      (interactive)
      (let ((b (if mark-active (min (point) (mark)) (point-min)))
            (e (if mark-active (max (point) (mark)) (point-max))))
        (shell-command-on-region b e
                                 "python -m json.tool" (current-buffer) t)))


    (provide 'setup-json-mode)
    ;;; setup-json-mode.el ends here

#+end_src

***** Org-Mode

****** org-roam
:PROPERTIES:
:ID:       08fd0c13-2ad4-441a-bf4c-c2b7fc6ddb99
:END:

(use-package org-roam :ensure t)

Is compiler there? Should be non-nil:

(executable-find "cc")

cgeng@ap-cgeng:~/.emacs.d/elpa/emacsql-sqlite-20221127.2146/sqlite$ ls -tl
total 8968
-rw-r--r-- 1 cgeng domain users  613416 Dez  1 20:47 sqlite3.h
-rw-r--r-- 1 cgeng domain users    5070 Dez  1 20:47 emacsql.c
-rw-r--r-- 1 cgeng domain users     472 Dez  1 20:47 Makefile
[[id:b09fc1fc-59c5-41d7-9f9d-d5be24f6659d][Meine erste idee]][[id:162bc05a-673f-454a-a368-7ffd25702081][meine zweite Idee]]-rw-r--r-- 1 cgeng domain users 8549001 Dez  1 20:47 sqlite3.c

https://emacs.stackexchange.com/questions/56064/cannot-enable-org-roam-mode-no-emacsql-sqlite-binary-avaiable

 (org-roam find executable sqlite3)

make emacsql-sqlite

#+begin_src emacs-lisp
(use-package org-roam
  :straight t
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "~/RoamNotes")
  (org-roam-completion-everywhere t)
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n i" . org-roam-node-insert)
         :map org-mode-map
         ("C-M-i" . completion-at-point)
         :map org-roam-dailies-map
         ("Y" . org-roam-dailies-capture-yesterday)
         ("T" . org-roam-dailies-capture-tomorrow))
  :bind-keymap
  ("C-c n d" . org-roam-dailies-map)
  :config
  (require 'org-roam-dailies) ;; Ensure the keymap is available
  (org-roam-db-autosync-mode))
#+end_src

#+RESULTS:
: t

******* Getting Started with Org Roam - Build a Second Brain in Emacs*
:PROPERTIES:
:ID:       e13fdc2d-48a9-463b-8fdf-0e6cdb58b331
:END:

https://www.youtube.com/watch?v=AyhPmypHDEw
https://systemcrafters.cc/build-a-second-brain-in-emacs/getting-started-with-org-roam/

- org-roam-node-find create the node
- org roam node insert Link to other node:
- org-roam-buffer-toggle

******* Capturing notes efficiently

https://www.youtube.com/watch?v=YxgA5z2R08I&t=0s
https://systemcrafters.net/build-a-second-brain-in-emacs/capturing-notes-efficiently/


******* Org Roam: The Best Way to Keep a Journal in Emacs

https://www.youtube.com/watch?v=3-sLBaJAtew&t=0s
https://systemcrafters.net/build-a-second-brain-in-emacs/keep-a-journal/


******* System Crafters Live! - Can You Apply Zettelkasten in Emacs?

https://www.youtube.com/watch?v=-TpWahIzueg
https://systemcrafters.net/live-streams/august-06-2021/

Video von Sönke Ahrens: https://www.youtube.com/watch?v=JnS3g68zCXw

****** Setting requiring main entry Point


==(load "org-capture-templates-slim")=  wird in =setup-org= geladen.
Dort wird die Browser Extension dann konfiguriert.

Default Values:

- selected template: p
- unselected template: L


My Values:

- selected template: op
- unselected template: oL


#+begin_src emacs-lisp
  (require 'setup-org) ;; organizer todo notes etc
#+end_src

****** Setting up org-general
