Emacs.org
****** org-capture-extension

https://github.com/sprig/org-capture-extension


#+begin_src bash :results output pp
ls -l "${HOME}/.local/share/applications/" | grep org
#+end_src

#+RESULTS:
: -rw-r--r-- 1 cgeng domain users 145 Nov 22 16:15 org-protocol.desktop

#+begin_src bash :results output pp
  cat > "${HOME}/.local/share/applications/org-protocol.desktop" << EOF
  [Desktop Entry]
  Name=org-protocol
  Exec=emacsclient %u
  Type=Application
  Terminal=false
  Categories=System;
  MimeType=x-scheme-handler/org-protocol;
  EOF

  update-desktop-database ~/.local/share/applications/
#+end_src

#+RESULTS:

sudo update-desktop-database

****** org tree slide

#+begin_src emacs-lisp
(use-package org-tree-slide
  :custom
  (org-image-actual-width nil))
#+end_src


- org-tree-slide-mode
- Navivation:
    C-< org-tree-slide-move-previous-tree
    C-> org-tree-slide-move-next-tree
#+begin_src emacs-lisp :tangle no :noweb yes
(with-eval-after-load "org-tree-slide"
  (define-key org-tree-slide-mode-map (kbd "<f9>") 'org-tree-slide-move-previous-tree)
  (define-key org-tree-slide-mode-map (kbd "<f10>") 'org-tree-slide-move-next-tree)
  )
  #+end_src



****** org toc mode
#+begin_src emacs-lisp
(if (require 'toc-org nil t)
    (progn
      (add-hook 'org-mode-hook 'toc-org-mode)

      ;; enable in markdown, too
      (add-hook 'markdown-mode-hook 'toc-org-mode)
      (define-key markdown-mode-map (kbd "\C-c\C-o") 'toc-org-markdown-follow-thing-at-point))
  (warn "toc-org not found"))
  #+end_src

***** google drive location menu


#+begin_src emacs-lisp :tangle no

  (require 'setup-user-menu)
   (system-name)
   (string-match-p (regexp-quote "compute3") (system-name))
  (if (string-match-p (regexp-quote "compute3") (system-name))
      (print ";"))
(if (string-match-p (regexp-quote "compute3") (system-name)) (print ";"))
#+end_src

***** speedbar

the setup is broken, not using it at the moment

#+begin_src emacs-lisp
  ;; (require 'setup-speedbar)
#+end_src



***** Enable shellcheck

see https://github.com/federicotdn/flymake-shellcheck

An extended tutorial can be found [[https://www.cyberciti.biz/programming/improve-your-bashsh-shell-script-with-shellcheck-lint-script-analysis-tool/][here]].


#+begin_src emacs-lisp
  (use-package flymake-shellcheck
  :commands flymake-shellcheck-load
  :init
  (add-hook 'sh-mode-hook 'flymake-shellcheck-load))

#+end_src

******* Shell prompt


******** Recommendations
:PROPERTIES:
:ID:       ad5cc4be-3a56-4208-90e3-173b17837c02
:END:

https://stackoverflow.com/questions/12224909/is-there-a-way-to-get-my-emacs-to-recognize-my-bash-aliases-and-custom-functions/12229404#12229404

#+begin_src emacs-lisp :tangle no
  ;; ->  make  all  envs  visible in  also org mode
  (setq shell-file-name "bash")
  (setq shell-command-switch "-ic")
#+end_src

- The solution is to leave the shell-command-switch variable at its default value, which is just -c.
https://emacs.stackexchange.com/questions/3447/cannot-set-terminal-process-group-error-when-running-bash-script

#+begin_src emacs-lisp
  (setq shell-file-name "bash")
  (setq shell-command-switch "-c")
#+end_src



******* safe local variables
:PROPERTIES:
:ID:       7a719b5d-aa8c-4110-9859-5aea715e044b
:END:

#+begin_src emacs-lisp

  ;; - '(safe-local-variable-values '((testvar\  . "hello")))
  ;; + '(safe-local-variable-values
  ;; +   '((pyvenv-activate . "~/.venvs/py37/")
  ;; +     (testvar\  . "hello")))
  ;;   '(sql-connection-alist
  ;;     '(("dataupload local container mysql"

  ;; (put 'pyvenv-activate 'safe-local-variable (lambda (_) t))

  ;; projectile-project-test-cmd :

  (put 'pyvenv-activate 'safe-local-variable (lambda (_) t))
  (put 'projectile-project-test-cmd 'safe-local-variable (lambda (_) t))
  (put 'py-pythonpath  'safe-local-variable (lambda (_) t))


#+end_src





******* fix missing alt-key in WSL
:PROPERTIES:
:ID:       52d2df23-c894-4ce0-b82b-1023c29e4483
:END:

WSL for Windows specific code

#+begin_src emacs-lisp
  (setq x-alt-keysym 'meta)
  (put 'set-goal-column 'disabled nil)
#+end_src

***** Collected Other Mode Configurations


#+begin_src emacs-lisp
  ;; (require 'setup-speedbar)

  ;; (eval-after-load 'sgml-mode '(require 'setup-html-mode))
  (eval-after-load 'lisp-mode '(require 'setup-lisp))

  (require 'setup-plantuml) ;; organizer todo notes etc

  (require 'setup-latex)

  (require 'setup-calendar)
  ;;(require 'setup-bash)
  (require 'setup-octave)
  ;; (require 'mc)

  ;;(require 'setup-web-mode)
  ;; (require 'setup-jabber)
  (require 'setup-chat-tracking)
  ;; (eval-after-load 'ruby-mode '(require 'setup-ruby-mode))
  (eval-after-load 'clojure-mode '(require 'setup-clojure-mode))
  ;; (eval-after-load 'markdown-mode '(require 'setup-markdown-mode))
  ;;(require 'setup-pandoc)

  ;; Load slime-js when asked for
  ;; (autoload 'slime-js-jack-in-browser "setup-slime-js" nil t)
  ;; (autoload 'slime-js-jack-in-node "setup-slime-js" nil t)

  ;; Map files to modes
  (require 'mode-mappings)


  ;; (require 'expand-region)
  ;; (require 'mark-more-like-this)
  ;; (require 'inline-string-rectangle)
  ;;(require 'multiple-cursors)
  ;; (require 'delsel)
  ;; (require 'jump-char)
  ;; (require 'eproject)
  ;; (require 'wgrep)
  ;; (require 'smart-forward)
  ;; (require 'change-inner)
  ;; (require 'multifiles)


  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; Ansi Farben in compilation buffers:                                                                  ;;
  ;; Also hook:                                                                                           ;;
  ;; https://stackoverflow.com/questions/13397737/ansi-coloring-in-compilation-mode                       ;;
  ;; Als Function:                                                                                        ;;
  ;; https://stackoverflow.com/questions/23378271/how-do-i-display-ansi-color-codes-in-emacs-for-any-mode ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (defun display-ansi-colors ()
    (interactive)
    (let ((inhibit-read-only t))
      (ansi-color-apply-on-region (point-min) (point-max))))

  (require 'ansi-color)
  (defun colorize-compilation-buffer ()
    (toggle-read-only)
    (ansi-color-apply-on-region compilation-filter-start (point))
    (toggle-read-only))
  (add-hook 'compilation-filter-hook 'colorize-compilation-buffer)
  ;; gehen alle nicht;
                                          ; (add-hook 'sbt-mode-hook 'display-ansi-colors)
  ;; (add-hook 'sbt-mode-hook 'ansi-color-for-comint-mode-on)
  ;; (add-to-list 'comint-output-filter-functions 'ansi-color-process-output)
  ;; (add-hook 'async-bytecomp-package-mode-hook 'colorize-compilation-buffer)

  ;; Fill column indicator
  ;; (require 'fill-column-indicator)

  ;; Browse kill ring
  (require 'browse-kill-ring)
  (setq browse-kill-ring-quit-action 'save-and-restore)

  (require 'setup-ibuffer)
  (require 'setup-doom-modeline)

  ;; (require 'setup-eclim)
  ;; This currently breaks dired icons. Why?
  ;; (require 'setup-scala)
  (require 'setup-treemacs)
  (require 'setup-groovy)
  ;; (require 'setup-eclim)

  ;; Misc
  ;; (require 'appearance)

  ;; (diminish 'eldoc-mode)
  ;; (diminish 'paredit-mode)

  ;; Elisp go-to-definition with M-. and back again with M-,
  ;; (autoload 'elisp-slime-nav-mode "elisp-slime-nav")
  ;; (add-hook 'emacs-lisp-mode-hook (lambda () (elisp-slime-nav-mode t) (eldoc-mode 1)))
  ;; (eval-after-load 'elisp-slime-nav '(diminish 'elisp-slime-nav-mode))

  ;; Email, baby
  ;; (require 'setup-mule)

  ;; Run at full power please
  (put 'downcase-region 'disabled nil)
  (put 'narrow-to-region 'disabled nil)

  (put 'scroll-left 'disabled nil)


  (setq abbrev-file-name             ;; tell emacs where to read abbrev
        "~/.emacs.d/abbrev_defs")    ;; definitions from...

  ;;(add-to-list 'load-path "/path/to/downloaded/openwith.el")
  ;;./elpa/openwith-20120531.1436/openwith.el:1

  ;; ("\\.pdf\\'"  "okular" (file))

  (require 'openwith)
  (setq openwith-associations '(
                                ("\\.pdf\\'"  "okular" (file))
                                ("\\.mp4\\'"  "vlc" (file))
                                ("\\.docx\\'" "lowriter" (file))
                                ("\\.odt\\'"  "lowriter" (file))
                                ("\\.pptx\\'"  "loimpress" (file))
                                ))
  ;; unset associations altogether
  ;; (setq openwith-associations '())

  (openwith-mode)
  (display-battery-mode)
  (setq require-final-newline nil)

  (require 'setup-nxml)
  ;; (require 'setup-pdf-tools)
  (require 'setup-json-mode)
  (require 'setup-magit)
  ;; (require 'setup-tags)

  (require 'setup-flycheck-mode)
  ;; company mode autocompletion
  ;;(add-hook 'after-init-hook 'global-company-mode)

  ;;(require 'pasc-mode)

  ;; (require 'setup-supercollider)
  (require 'setup-yaml-mode)
  (require 'setup-editorconfig)
  (require 'setup-rtags)
  (require 'setup-treemacs)

  (require 'setup-shell-scripting)
  (require 'calfw)
  (require 'calfw-gcal)
  (require 'calfw-org)
  (require 'calfw-gcal)
  (require 'calfw-ical)

  (put 'erase-buffer 'disabled nil)

  ;; fix misalignment in popus:
  (setq popup-use-optimized-column-computation nil)

  (add-hook 'makefile-mode-hook 'makefile-executor-mode)

#+end_src

***** yasnippet

#+begin_src emacs-lisp
  (require 'setup-yasnippet)
  (define-key yas-minor-mode-map [(tab)] nil)
  (define-key yas-minor-mode-map (kbd "TAB") nil)
  (message "nach yasnippet loading")
#+end_src


***** Auth Source, GPG, Security

This section explains how to store and retrieve credentials in Emacs using
`auth-source`, and how to manage your GPG keys and agent. It replaces ad-hoc
snippets with a minimal, reliable setup.

- Reference: https://github.com/daviwil/emacs-from-scratch/blob/master/show-notes/Emacs-Tips-Pass.org
- Video: https://www.youtube.com/watch?v=nZ_T7Q49B8Y

****** Configure auth-sources (encrypted credentials)

Keep credentials in `org-directory` using `.authinfo.gpg` (encrypted). Optionally
fall back to `.authinfo` if needed.

#+begin_src emacs-lisp
  ;; Use encrypted authinfo in org directory (preferred)
  (add-to-list 'auth-sources (joindirs org-directory ".authinfo.gpg"))
  ;; Optional: also consider a plaintext fallback if you really need it
  (add-to-list 'auth-sources (joindirs org-directory ".authinfo"))
#+end_src

Notes:

- Files like `Notes.org.gpg` are not in authinfo/netrc format; do not add them
  to `auth-sources`.
- You can always inspect the active sources during a session:

#+begin_src emacs-lisp :tangle no
  (mapc #'message auth-sources)
#+end_src

#+RESULTS:
| ~/.authinfo | ~/.authinfo.gpg | ~/.netrc |

****** Querying credentials with auth-source

Use `auth-source-search` to find entries. Prefer `:host` or `:machine` with `:user`.

#+begin_src emacs-lisp :tangle no
  ;; Example lookups (adjust :user to your login/user where applicable)
  (auth-source-search :host "chat.openai.com" :user "my-user")
  (auth-source-search :machine "real.de" :user "my-user")

  ;; Get the secret string (helper)
  (defun cg/auth-lookup (&rest keys)
    "Return secret string for KEYS passed to `auth-source-search`, or nil."
    (when-let* ((res   (apply #'auth-source-search keys))
                (first (car res))
                (sec   (plist-get first :secret)))
      (if (functionp sec) (funcall sec) sec)))

  ;; Examples (non-tangled):
  ;; (cg/auth-lookup :host "codeium.com" :user "privat-email-account")
  ;; (cg/auth-lookup :host "mailprovider.com" :user "me")

  ;; Clear cached entries if you changed your files
  (auth-source-forget-all-cached)
#+end_src

If you use `auth-source-pass`, you can also query pass entries, e.g.:

#+begin_src emacs-lisp :tangle no
  (auth-source-pass-get 'secret "openai-key")
#+end_src

****** GPG: Generate a key (once)

#+begin_src shell :tangle no
gpg --full-generate-key
#+end_src

Recommended choices:

- Type: RSA and RSA
- Size: 4096
- Expiration: never (or set a sensible expiry and rotate)
- Provide Real Name, Email, and a strong passphrase

Inspect keys and key storage:

#+begin_src shell :tangle no
gpg --list-keys
ls -t ~/.gnupg/
ls -la ~/.gnupg/private-keys-v1.d
#+end_src

****** GPG: Migrate key to another machine

1) Identify your secret key ID

#+begin_src shell :tangle no
gpg --list-secret-keys user@email.com
#+end_src

2) Export and transfer securely

#+begin_src shell :tangle no
gpg --export-secret-keys <KEYID> > private.key
# ... transfer private.key securely (e.g., scp over a trusted channel) ...
#+end_src

3) Import on the target machine

#+begin_src shell :tangle no
gpg --import private.key
# Some tools use gpg2 (Thunderbird/Enigmail)
gpg2 --import private.key
#+end_src

Delete `private.key` after import.

****** GPG agent configuration (caching)

View your current agent config:

#+begin_src shell :tangle no
cat ~/.gnupg/gpg-agent.conf
#+end_src

Reload agent and inspect defaults:

#+begin_src shell :tangle no
gpgconf --kill gpg-agent
gpgconf --reload gpg-agent
gpgconf --list-options gpg-agent | grep -E 'default-cache|max-cache'
#+end_src

Example settings you may consider in `~/.gnupg/gpg-agent.conf`:

#+begin_example
default-cache-ttl 7200
max-cache-ttl 31536000
default-cache-ttl-ssh 1800
max-cache-ttl-ssh 7200
#+end_example

Then reload the agent as above.

****** GNOME/Ubuntu notes (passphrase caching)

If GNOME keyring controls caching, you can adjust via `dconf-editor`:

- Launch dconf-editor
- Navigate: desktop → gnome → crypto → cache
- Set `gpg-cache-method` to `idle` or `timeout`
- Set `gpg-cache-ttl` to desired seconds
- Restart keyring: `gnome-keyring-daemon -r`

References:

- Emacs passphrase prompt discussion: https://emacs.stackexchange.com/questions/37002/emacs-opens-gpg-file-without-asking-for-passphrase
- GNOME caching duration: https://askubuntu.com/q/340809

****** macOS notes
:PROPERTIES:
:ID:       7ef44450-4c70-4117-8a72-44d99a0138e3
:END:
#+begin_src emacs-lisp :tangle no
  ;; Detect macOS and import shell env if needed
  (setq is-mac (equal system-type 'darwin))
  (when is-mac (exec-path-from-shell-initialize))
  ;; (when is-mac (require 'mac))
#+end_src


***** codeium

****** Key Configuration

Found at this [[https://gist.github.com/togakangaroo/8b0ca3a4d71f6c31ce22d2f40aed7932][this post]].

#+begin_src emacs-lisp
    (defun get-codeium-api-key ()
      "Retrieve the codeium API key from one of the authinfo files."
      (let ((auth (nth 0 (auth-source-search
                          :site "codeium.com"
                          :user "privat-email-account"
                          :max 1
                          :require '(:secret)))))
        (if auth
            (funcall (plist-get auth :secret))
          (error "No codeium API key found in authinfo file(s)"))))

  (defvar codeium/metadata/api_key (get-codeium-api-key) "Your codeium key for accessing the ChatGPT API.")
#+end_src

#+RESULTS:
: codeium/metadata/api_key

(get-codeium-api-key)
(codeium/metadata/api_key)
(mapc 'message auth-sources)
;; (setq codeium/metadata/api_key (get-codeium-api-key))

****** Installation
******* Manual installation - obsolete

# git submodule add --depth 1  https://github.com/Exafunction/codeium.el el/codeium
# (setq codeium-path "path_to_codeium_executable")
# (add-to-list 'load-path "~/.emacs.d/elcodeium.el")
# (require 'codeium)
# (require 'codeium)


#+begin_src emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/el/codeium/")
  (load-file (joindirs straight-base-dir "straight" "build" "codeium" "codeium.el"))
  ;;  ~/.config/emacs/31.0.50/straight/build/codeium/codeium.el
  #+end_src


(find-file  straight-base-dir)




****** Straight for codeium

#+begin_src emacs-lisp
  (straight-use-package '(codeium :type git :host github :repo "Exafunction/codeium.el"))
#+end_src

#+RESULTS:
: t

