Emacs.org
****** Codeium Configuration

#+begin_src emacs-lisp
;; we recommend using use-package to organize your init.el
(use-package codeium
    :straight t
    ;; if you use straight
    ;; :straight '(:type git :host github :repo "Exafunction/codeium.el")
    ;; otherwise, make sure that the codeium.el file is on load-path

    :init
    ;; use globally
    (add-to-list 'completion-at-point-functions #'codeium-completion-at-point)
    ;; or on a hook
    ;; (add-hook 'python-mode-hook
    ;;     (lambda ()
    ;;         (setq-local completion-at-point-functions '(codeium-completion-at-point))))

    ;; if you want multiple completion backends, use cape (https://github.com/minad/cape):
    ;; (add-hook 'python-mode-hook
    ;;     (lambda ()
    ;;         (setq-local completion-at-point-functions
    ;;             (list (cape-super-capf #'codeium-completion-at-point #'lsp-completion-at-point)))))
    ;; an async company-backend is coming soon!

    ;; codeium-completion-at-point is autoloaded, but you can
    ;; optionally set a timer, which might speed up things as the
    ;; codeium local language server takes ~0.2s to start up
    ;; (add-hook 'emacs-startup-hook
    ;;  (lambda () (run-with-timer 0.1 nil #'codeium-init)))

    ;; :defer t ;; lazy loading, if you want
    :config
    (setq use-dialog-box nil) ;; do not use popup boxes

    ;; if you don't want to use customize to save the api-key
    ;; (setq codeium/metadata/api_key "xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx")

    ;; get codeium status in the modeline
    (setq codeium-mode-line-enable
        (lambda (api) (not (memq api '(CancelRequest Heartbeat AcceptCompletion)))))
    (add-to-list 'mode-line-format '(:eval (car-safe codeium-mode-line)) t)
    ;; alternatively for a more extensive mode-line
    ;; (add-to-list 'mode-line-format '(-50 "" codeium-mode-line) t)

    ;; use M-x codeium-diagnose to see apis/fields that would be sent to the local language server
    (setq codeium-api-enabled
        (lambda (api)
            (memq api '(GetCompletions Heartbeat CancelRequest GetAuthToken RegisterUser auth-redirect AcceptCompletion))))
    ;; you can also set a config for a single buffer like this:
    ;; (add-hook 'python-mode-hook
    ;;     (lambda ()
    ;;         (setq-local codeium/editor_options/tab_size 4)))

    ;; You can overwrite all the codeium configs!
    ;; for example, we recommend limiting the string sent to codeium for better performance
    (defun my-codeium/document/text ()
        (buffer-substring-no-properties (max (- (point) 3000) (point-min)) (min (+ (point) 1000) (point-max))))
    ;; if you change the text, you should also change the cursor_offset
    ;; warning: this is measured by UTF-8 encoded bytes
    (defun my-codeium/document/cursor_offset ()
        (codeium-utf8-byte-length
            (buffer-substring-no-properties (max (- (point) 3000) (point-min)) (point))))
    (setq codeium/document/text 'my-codeium/document/text)
    (setq codeium/document/cursor_offset 'my-codeium/document/cursor_offset))
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (26337 64832 798951 444000) :use-package-secs (0 0 259964 965000) :init (26337 64832 798949 77000) :config (26337 64832 798936 537000) :config-secs (0 0 21 78000) :init-secs (0 0 9372 115000)))

****** Codeium comany

#+begin_src emacs-lisp :tangle no
(use-package company
    :defer 0.1
    :config
    (global-company-mode t)
    (setq-default
        company-idle-delay 0.05
        company-require-match nil
        company-minimum-prefix-length 0

        ;; get only preview
        company-frontends '(company-preview-frontend)
        ;; also get a drop down
        ;; company-frontends '(company-pseudo-tooltip-frontend company-preview-frontend)
        ))
#+end_src

#+RESULTS:
: #s(hash-table data (:use-package (26337 60415 137928 602000) :init (26337 60415 137926 222000) :config (26337 60415 137919 433000) :config-secs (0 0 1271 437000) :init-secs (0 0 1304 675000) :use-package-secs (0 0 1311 208000)))



#+RESULTS:
: codeium/metadata/api_key






***** Edit as sudo
:PROPERTIES:
:ID:       8ee4a7b9-f9e7-422e-8c04-3c17a61da460
:END:

#+begin_src emacs-lisp
  (defun edit-current-file-as-root ()
    "Edit the file that is associated with the current buffer as root"
    (interactive)
    (if (buffer-file-name)
        (progn
          (setq file (concat "/sudo:localhost:" (buffer-file-name)))
          (find-file file))
      (message "Current buffer does not have an associated file.")))
#+end_src

***** Imenu auto
:PROPERTIES:
:ID:       820994eb-2700-428a-a80b-d5e0ede6299d
:END:
#+begin_src emacs-lisp

  ;; add Imenu whenever possible.
  ;; see https://www.emacswiki.org/emacs/ImenuMode for documentation
  (defun try-to-add-imenu ()
    (condition-case nil (imenu-add-to-menubar "Index") (error nil)))
  (add-hook 'font-lock-mode-hook 'try-to-add-imenu)

#+end_src


***** Visible Bell off
:PROPERTIES:
:ID:       4b5650ad-478a-4c5e-8120-c56375abf02a
:END:

:PROPERTIES:
:ID:       6d9c48b7-0c81-4a42-a7f0-dfe149934fb2
:END:
#+begin_src emacs-lisp
  (setq visible-bell t)
  ;; ring-bell function not doing what its supposed to?
  ;; see https://www.emacswiki.org/emacs/AlarmBell
  ;; (defun ring-bell-function()
  ;;   "do not ring the bell when cursor has gone too far outside."
  ;;   (message "Went outside but not ringing the bell.")
  ;;     )
#+end_src

***** Ansible Vault Mode


#+begin_src emacs-lisp
  (setq ansible-vault-password-file "~/.ansible/vault_pass.txt")
  (add-to-list 'auto-mode-alist '("/encrypted$" . yaml-mode))

  (defun ansible-vault-mode-maybe ()
    (when (ansible-vault--is-encrypted-vault-file)
      (ansible-vault-mode 1)))

  (use-package ansible-vault
    :init (add-hook 'yaml-mode-hook 'ansible-vault-mode-maybe))

#+end_src

#+RESULTS:



***** Themes

Modus Migration Guide to V4 should probably be reviewed:
https://christiantietze.de/posts/2023/01/modus-themes-v4-changes/

#+begin_src emacs-lisp :tangle ./el/setup-themes.el :mkdirp yes
;;; setup-themes.el --- summary -*- lexical-binding: t -*-

;; Author: CGeng
;; Maintainer: CGeng
;; Version: version
;; Package-Requires: (dependencies)
;; Homepage: homepage
;; Keywords: keywords


;;; Commentary:

;; commentary

;;; Code:

;;; name.el ends here
;; (load-theme 'fantom)
;; jetbrains-darcula
; doom-1337

;;(load-theme 'moe-light) - unfortunatel colors, got it from the supercollider guy
;; (load-theme 'doom-1337)

;;
;; Configure the Modus Themes' appearance
(setq modus-themes-mode-line '(accented borderless)
      modus-themes-bold-constructs t
      modus-themes-italic-constructs t
      modus-themes-fringes 'subtle
      modus-themes-tabs-accented t
      modus-themes-paren-match '(bold intense)
      modus-themes-prompts '(bold intense)
      ;; modus-themes-completions 'opinionated
      modus-themes-org-blocks 'tinted-background
      modus-themes-scale-headings t
      modus-themes-region '(bg-only)
      modus-themes-headings
      '((1 . (rainbow overline background 1.4))
        (2 . (rainbow background 1.3))
        (3 . (rainbow bold 1.2))
        (t . (semilight 1.1))))

;; Load the dark theme by default
(load-theme 'modus-vivendi t)


;; (load-theme 'wombat)
(defcustom cycle-themes '(material material-light doom-solarized-dark doom-solarized-light atom-dark intellij idea-darkula subatomic moe-light)
  "List of themes through which one can switch easily by calling
`cycle-themes' repeatedly. The first element is loaded at startup."
  :type '(repeat symbol))

(defvar cycle-current-theme nil
  "Used internally to hold a pointer to the currently loaded theme.")

(defun reload-current-theme ()
  "Reload the theme in `cycle-current-theme', if it is active."
  (interactive)
  (when (custom-theme-enabled-p cycle-current-theme)
    (load-theme cycle-current-theme t)))


;; andere gute thems:
;; deeper-blue
;; misterioso
;; tango-dark tango

(defun cycle-themes ()
  "Cycle through themes from the variable cycle-themes."
  (interactive)
  (let ((next-theme (car (or (cdr (memq cycle-current-theme cycle-themes))
                             cycle-themes))))
    (when next-theme
     (when (custom-theme-enabled-p cycle-current-theme)
       (disable-theme cycle-current-theme))
     (when (load-theme next-theme t)
       (setq cycle-current-theme next-theme)))))

;; (dolist (feature '(magit org-faces whitespace flyspell))
;;   (unless (featurep feature)
;;     (eval-after-load feature '(reload-current-theme))))


;; cycle theme once at startup.
;; (when (fboundp 'cycle-themes)
;;  (cycle-themes))

(provide 'setup-themes)
#+end_src

#+begin_src emacs-lisp
  (require 'setup-themes)
#+end_src

***** csv mode

#+begin_src emacs-lisp

(require 'cl)
(require 'color)

(defun csv-highlight (&optional separator)
  (interactive (list (when current-prefix-arg (read-char "Separator: "))))
  (font-lock-mode 1)
  (let* ((separator (or separator ?\,))
         (n (count-matches (string separator) (point-at-bol) (point-at-eol)))
         (colors (cl-loop for i from 0 to 1.0 by (/ 2.0 n)
                       collect (apply #'color-rgb-to-hex
                                      (color-hsl-to-rgb i 0.3 0.5)))))
    (cl-loop for i from 2 to n by 2
          for c in colors
          for r = (format "^\\([^%c\n]+%c\\)\\{%d\\}" separator separator i)
          do (font-lock-add-keywords nil `((,r (1 '(face (:foreground ,c)))))))))

#+end_src

#+RESULTS:
: csv-highlight

#+begin_src emacs-lisp
    (add-hook 'csv-mode-hook 'csv-highlight)
    (add-hook 'csv-mode-hook 'csv-align-mode)
    (add-hook 'csv-mode-hook '(lambda () (interactive) (toggle-truncate-lines nil)))
#+end_src

#+RESULTS:
| t | csv-align-mode |


***** Language-Tool

in the jars directory there is a download script
https://github.com/mhayashi1120/Emacs-langtool?tab=readme-ov-file
  ;; (joindirs user-emacs-directory "jars" "LanguageTool-6.4" "languagetool-commandline.jar")

#+begin_src emacs-lisp
  (setq langtool-language-tool-server-jar (joindirs user-emacs-directory "jars" "LanguageTool-6.4" "languagetool-server.jar"))
  (require 'langtool)
#+end_src

***** Ascidoctor

Link collection here:

https://www.emacswiki.org/emacs/AsciiDoc

****** Adoc Snippets

git@github.com:nicorikken/adoc-mode-yasnippet.git

see in snippets

****** open adoc files
:PROPERTIES:
:ID:       8ebfb281-87fd-49f7-b513-19a4c3b0b492
:END:

#+begin_src emacs-lisp
  (require 'adoc-mode)
  (add-to-list 'auto-mode-alist '("\.adoc$" . adoc-mode))
  ;;  (add-to-list adoc-mode '("\\.adoc\\'" . adoc-mode))
  (autoload 'adoc-mode "adoc-mode" nil t)
#+end_src

#+RESULTS:

****** adoc mode preview
:PROPERTIES:
:ID:       8f6ef9ec-ffa0-4e07-90c0-37f08216106a
:END:

#+begin_src emacs-lisp
  (defun rcd-command-output-from-input (program input &rest args)
    "Returns output from PROGRAM INPUT with optional ARGS"
    (let* ((output (with-temp-buffer
                     (insert input)
                     (apply #'call-process-region nil nil program t t nil args)
                     (buffer-string))))
      output))

  (defun rcd-asciidoctor (string &rest args)
    (interactive)
    "Returns plain text from Markdown by using pandoc"
    (apply 'rcd-command-output-from-input "asciidoctor" string "-" args))

  (defun rcd-asciidoctor-preview ()
    "Preview asciidoctor"
    (interactive)
    (let* ((output (rcd-asciidoctor (buffer-string)))
           (file (concat (or (getenv "TMPDIR") "/tmp/") "asciidoctor.html")))
      (with-temp-file file (insert output))
      (browse-url file)))

  ;; (global-set-key (kbd "C-c a") 'rcd-asciidoctor-preview)
#+end_src

#+RESULTS:
: rcd-asciidoctor-preview

****** Org ascidoc
:PROPERTIES:
:ID:       59738c74-4023-4a75-8180-a424222ba95e
:END:

Org ascidoc exporter
Repo is here: git clone git@github.com:yashi/org-asciidoc.git

#+begin_src emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/el/org-asciidoc")
  (require 'ox-asciidoc)
#+end_src

#+RESULTS:
: ox-asciidoc

***** Always load .local_configs as shell script
:PROPERTIES:
:ID:       7bdb08dc-a901-4bab-912b-50271f3f6f76
:END:
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '(".local_configs" . shell-script-mode))
#+end_src

***** Emacs Server
:PROPERTIES:
:ID:       91011ca1-3a58-4d79-ba3a-21b27eb355b7
:END:

#+begin_src emacs-lisp
  (require 'server)
  (unless (server-running-p)
    (server-start))
#+end_src


***** Emacs as daemon


Startin the daemon

#+begin_example bash
emacs --daemon
nohup_dated emacs --daemon &
#+end_example


[[https://www.emacswiki.org/emacs/EmacsAsDaemon#h5o-10][Stopping the Emacs Daemon]]:

#+begin_src emacs-lisp
;; define function to shutdown emacs server instance
(defun server-shutdown ()
  "Save buffers, Quit, and Shutdown (kill) server"
  (interactive)
  (save-some-buffers)
  (kill-emacs)
  )
#+end_src

The link above also contains more fancy code that asks for unsaved buffers first.


Links:

https://medium.com/@lukaszkorecki/emacs-as-tmux-replacement-2acd10d7dfc8
https://emacs.stackexchange.com/questions/53036/switching-from-tmux-terminal-emacs-to-emacs-only
https://emacs.stackexchange.com/questions/35587/emacs-client-cant-find-server-in-terminal


***** dired

#+begin_src emacs-lisp
  (require 'setup-dired)
#+end_src


***** Get Temperature

Shell Script to get get temperatures
# temperatures=$(cat /sys/class/thermal/thermal_zone*/temp  | tr '\n' '/')

