Emacs.org
***** Web Server

#+begin_src emacs-lisp
  (use-package simple-httpd
    :ensure t)
#+end_src

***** Supress always deleting trailing whitespace

None of these work yet.


#+begin_src emacs-lisp
  (add-hook 'write-file-hooks 'delete-trailing-whitespace nil t)
  (defun nuke_trailing ()
  (add-hook 'before-save-hook #'delete-trailing-whitespace nil t))
(add-hook 'prog-mode-hook #'nuke_trailing)
#+end_src

#+RESULTS:
| nuke_trailing | nuke_traling | rainbow-delimiters-mode | editorconfig-major-mode-hook |

https://stackoverflow.com/questions/19174302/emacs-only-delete-trailing-whitespace-while-saving-in-programming-mode

* Misc
** Applications Config Example

*** Some App
:PROPERTIES:
:ID:       216fa964-a617-4a95-b3f4-3bd82856d8b1
:END:

This is an example of configuring another non-Emacs application using org-mode.  Not only do we write out the configuration at =.config/some-app/config=, we also compute the value that gets stored in this configuration from the Emacs Lisp block above it.

#+NAME: the-value
#+begin_src emacs-lisp :tangle no

  (+ 55 100)

#+end_src

*NOTE*: Set the =:tangle= parameter below to =.config/some-app/config= for this to work!

#+begin_src emacs-lisp :tangle no :noweb yes

  ;;  value=<<the-value()>>
  (setq value <<the-value()>>)

#+end_src

#+begin_src emacs-lisp :noweb yes

  ;;  value=<<the-value()>>
  (setq value <<the-value()>>)

#+end_src
